<template>
    <div>
        <v-container>
            <v-row class="py-10">
                <v-col cols="12" class="d-flex justify-center">
                    <h3>{{amharic.title}}</h3>
                </v-col>

                <v-col cols="12" class="d-flex justify-end"> ቀን {{date}} G.C</v-col>
            </v-row>


            <v-row>
                <p>ይህ የውል ስምምነት የተዘጋጀው እና የተፈፀመው በፍቅር መዐድ በፍቃደኝነት ላይ የተመሠረተ የስጦታ ሲስተም ስልጠና ኃ/የተ/የግ/ማ አድራሻ አ/አ በሆነ ተመዝግቦ በኢትዮጵያ ህግ መሠረት በተቋቋመው ድርጅት ከዚህ በኋላ "አገልግሎት ሰጪ/ ድርጅት" እየተባለ በሚጠራው እና አቶ/ ወ/ሮ  <span class="font-weight-black"> {{user.first_name}}  {{user.last_name}} </span> አድራሻ ____       ከዚህ በኋላ "አገልግሎት ተጠቃሚ/ ተዋዋይ" እየተባሉ በሚጠሩ መካከል የተፈፀመ ስምምንት ነው::</p>

                <!-- services object  -->
                <v-col cols="12" class="d-flex justify-center">
                    <h3>{{amharic.service.title}}</h3>
                </v-col>
                <p>{{amharic.service.para}}</p>
                <ul v-for="(list,index) in amharic.service.lists" :key="index">
                    <li>{{list}}</li>
                </ul>

                <!-- work object  -->
                <v-col cols="12" class="d-flex justify-center">
                    <h3>{{amharic.work.title}}</h3>
                </v-col>
                <ul v-for="(list,index) in amharic.work.lists" :key="index">
                    <li>{{list}}</li>
                </ul>
                <!-- agreement object  -->

                <v-col cols="12" class="d-flex justify-center">
                    <h3>{{amharic.agreement.title}}</h3>
                </v-col>
                <p>{{amharic.agreement.para}}</p>

                <!-- ownership object  -->
                <v-col cols="12" class="d-flex justify-center">
                    <h3>{{amharic.ownership.title}}</h3>
                </v-col>
                <p>{{amharic.ownership.para}}</p>


                <!-- partnership object  -->
                <v-col cols="12" class="d-flex justify-center">
                    <h3>{{amharic.partnership.title}}</h3>
                </v-col>
                <p>{{amharic.partnership.para}}</p>


                <!-- payment object   -->
                <v-col cols="12" class="d-flex justify-center">
                    <h3>{{amharic.payment.title}}</h3>
                </v-col>
                <ul v-for="(list,index) in amharic.payment.lists" :key="index">
                    <li>{{list}}</li>
                </ul>


                <!-- TerminationOfCcontract object  -->
                <v-col cols="12" class="d-flex justify-center">
                    <h3>{{amharic.TerminationOfCcontract.title}}</h3>
                </v-col>
                <ul v-for="(list,index) in amharic.TerminationOfCcontract.lists" :key="index">
                    <li>{{list}}</li>
                </ul>

                <!-- KeepingAsecret object -->

                <v-col cols="12" class="d-flex justify-center">
                    <h3>{{amharic.KeepingAsecret.title}}</h3>
                </v-col>
                <div v-for="(para,index) in amharic.KeepingAsecret.paras" :key="index">
                    <p>{{para}}</p>
                </div>
                <ul v-for="(list,index) in amharic.KeepingAsecret.lists" :key="index">
                    <li>{{list}}</li>
                </ul>
                <p>{{amharic.KeepingAsecret.lastpara}}</p>

                <!-- Compensation object  -->
                <v-col cols="12" class="d-flex justify-center">
                    <h3>{{amharic.Compensation.title}}</h3>
                </v-col>
                <p>{{amharic.Compensation.para}}</p>


                <!-- ApplicableLaws object  -->
                <v-col cols="12" class="d-flex justify-center">
                    <h3>{{amharic.ApplicableLaws.title}}</h3>
                </v-col>
                <p>{{amharic.ApplicableLaws.para}}</p>

                <!-- Improvement object  -->

                <v-col cols="12" class="d-flex justify-center">
                    <h3>{{amharic.Improvement.title}}</h3>
                </v-col>
                <p class="d-flex justify-center">{{amharic.Improvement.para}}</p>
                <!-- final para  -->
                <v-col cols="12" class="d-flex justify-center">
                    <h3>{{amharic.termination}}</h3>
                </v-col>
                <!-- <h4 class="d-flex justify-center">{{amharic.termination}}</h4> -->
            </v-row>
        </v-container>
    </div>
</template>
<script>
    import {
        mapGetters
    } from 'vuex'
    export default {
        data() {
            return {
                date: (new Date(Date.now() - (new Date()).getTimezoneOffset() * 60000)).toISOString().substr(0, 10),

                amharic: {
                    title: 'የውል ስምምነት (Ahaadii waligaltee)',
                    para: 'ይህ የውል ስምምነት የተዘጋጀው እና የተፈፀመው በፍቅር መዐድ በፍቃደኝነት ላይ የተመሠረተ የስጦታ ሲስተም ስልጠና ኃ/የተ/የግ/ማ አድራሻ true በሆነ ተመዝግቦ በኢትዮጵያ ህግ መሠረት በተቋቋመው ድርጅት ከዚህ በኋላ "አገልግሎት ሰጪ/ ድርጅት" እየተባለ በሚጠራው እና አቶ/ ወ/ሮ true አድራሻ ከዚህ በኋላ "አገልግሎት ተጠቃሚ/ ተዋዋይ" እየተባሉ በሚጠሩ መካከል የተፈፀመ ስምምንት ነው::',
                    service: {
                        title: '1. የአገልግሎት ተጠቃሚው ህጋዊ አቋም',
                        para: 'ለዚህ ውል አፈፃፀም የአገልግሎት ተጠቃሚው ከድርጅቱ ጋር ያለው ግንኙነት የቅጥርም ሆነ የሽርክና አለመሆኑን ሁለቱም ተዋዋይ ወገኖች በመግባባት ከዚህ የሚከተለውን ተስማምተዋል፡፡',
                        lists: [
                            '1.1. የአገልግሎት ተጠቃሚው አገልግሎት ሰጪው ባዘጋጀው የሞባይል ወይም ዌብ መተግበሪያ በመጠቀም በሙሉ ፍቃደኝነት ላይ የተመሰረተ የስጦታ (ዘመናዊ የእቁብ ስርዓት)ተጠቃሚ ለመሆንና ሌሎችም ግለሰቦች ይህንኑ አገልግሎት እንዲጠቀሙ መረጃ ለመስጠት ተስማምቷል፡፡',
                            '1.2. የአገልግሎት ተጠቃሚው በኢትዮጵያ ውስጥ ያሉ በፍትሐብሄር እና በወንጀል ህጎች እዲሁም በልዩ ልዩ ያልተጠቃለሉ ህጎች መሰረትና በተጨማሪም የድርጅቱን ስራ እና መልካም ስም የአሰራር ስርዓት ሂደት ደንብ እና መመሪያ በጠበቀ መልኩ አገልግሎት ሰጪው አዘጋጅቶ ያቀረበውን ዘመናዊ የስጦታ እና የእቁብ የሞባይል ወይም ዌብ መተግበሪያ ለመጠቀም ተስማምቷል፡፡',
                            '1.3. የአገልግሎት ተጠቃሚው የአገልግሎት ሰጪውን የሞባይል መተግበሪያ በመጠቀም ከሌሎች የአገልግሎት ሰጪ ደንበኞች ጋር የሚኖረው ግንኙነት በተመለከተ አስፈላጊውን የስራ ስነ-ምግባር በሙሉ ይከተላል፡፡',
                            '1.3. የአገልግሎት ተጠቃሚው የአገልግሎት ሰጪውን የሞባይል መተግበሪያ በመጠቀም ከሌሎች የአገልግሎት ሰጪ ደንበኞች ጋር የሚኖረው ግንኙነት በተመለከተ አስፈላጊውን የስራ ስነ-ምግባር በሙሉ ይከተላል፡፡',
                            '1.5. የአገልግሎት ተጠቃሚው አገልግሎቱን የሚጠቀምበትን ጊዜ፣ አገልግሎቱን መጠቀም የሚጀምርበት እና የሚያቆምበትን ጊዜ፣ የስራውን ሰዓት እና ቅድማ ተከተል እና ለውሉ አፈፃፀም ይረዳው ዘንድ የሚከተለውን የአሰራር ስልት በራሱ የመወሠን መብት አለው፡፡ ሆኖም ከዚህ የሚከተሉትን የአሰራር ደንብ እና መመሪያዎች እንዲሁም እንደ አስፈላጊነቱ ወይንም ህግ ሲያስገድድ ወደፊት በአገልግሎት ሰጪው የሚጨመሩ አሰራሮች ደንብ እና መመሪያዎችን ተከትሎ ይሰራል፡፡'
                        ]
                    },
                    work: {
                        title: '2.  የአሰራር ስርዓት መመሪያ',
                        lists: [
                            'ተዋዋይ k ት ላይ የሞላው መረጃ ትክክልኛና የተሟላ መሆኑን ያረጋግጣል፡፡',
                            'በ k ት ላይ ያለውን የድርጅቱን መረጃ ድርጅቱ ለማስተዋወቅና ለነባርና አዳዲስ አገልግሎት ተጠቃሚዎች የድርጅቱን አሰራር፣ ጥቅም እና ግዴታ ለማስተዋወቅ መጠቀም ይችላል፡፡',
                            'ማንያውም ነባር ተዋዋይ ለአዳዲስ አገልግሎት ተጠቃሚዎች  መረጃ/ገለፃ/ ሲሰጥ በድርጅቱ አሰራር መሰረት ብቻ መሆን አለበት፡፡',
                            'ማንኛውም ተዋዋይ አገልግሎቱን ለመጠቀም የአገልግሎት ሰጪው ባዘጋጀው የሞባይል መተግበሪያ ለመጠቀም ሲወስን ድርጅቱ ሲስተም/ፕላትፎርም/ላይ መመዝገብ እና የመመዝገቢያ ክፍያ ሲፈጽም ቫት ደረሰኝ መቀበል ይኖርበታል ይህንንም ደረሰኝ ለአፕሩቫል ሲሰተሙ ላይ ማያያዝ አለበት፡፡',
                            'ሁሉም ተዋዋዮች የ6 ሰዎች የእቁብ ብር እንደተቀበሉ 7500.00 (ሰባት ሺ አምስት መቶ ብር) ለቀጣይ ዙር የመጣል ግዴታ አለበት፡፡',
                            'ማንኛውም ተዋዋይ የአገልግሎት ክፍያ ሲስተሙ እንደጠየቀው በ24 ሰዓት ውስጥ ወዲያው መክፈል አለበት፡፡',
                            'ማንኛውም ተዋዋይ በድርጅቱ ስም የድርጅቱን አሰራር በመጠቀም ነገር ግን አገልግሎት ሰጪው ያለማውን የሞባይል መተግበሪያ ሳይጠቀም በምንም አይነት መልኩ ከአዲስም ሆነ ነባር አባላት ምንም አይነት ክፍያም ሆነ ስጦታ መቀበል አይችልም፡፡',
                            'የአገልግሎት ሰጪውን መተግበሪያ አሰራርና አጠቃቀም አሳሳች መረጃ በመስጠት ስርቆት፣ ማጭበርበር እና ሌሎች አሉታዊ ተግባራት ፈጽሞ የተገኘ እንደሆነ ወዲያውኑ ከአገልግሎት መስጫው ሲስተም ላይ እንዲሰረዝ ተደርጎ ጉዳዩን ለማጣራት፣ ለመመርመርና ለመወሰን ስልጣን ላለው የፖሊስ አካል እና ፍርድ ቤት እንዲቀርብ ይደረጋል',
                            'ነባርም ሆነ አዳዲስ አገልግሎት ተጠቃሚዎች በሌላ ነባር ወይንም አዲስ አባል ስለድርጅቱና ስለ አገልግሎቱ አሰራር እና አጠቃቀም ገለፃ የተሰጠውን አዲስ አገልግሎት ተጠቃሚ ግለሰብ እራሱ መረጃውን የሰጠ በማስመሰል፣ በማሳሳት፣ በማማለልና ከድርጅቱ አሰራር ውጪ የሆነ ያልተገባ ቃል በመግባት  መመዝገብ /ሲስተም መሰራረቅ/ ፈጽሞ የተከለከለ ነው፡፡',
                            'ማንኛውም ግለሰብ ከድርጅቱ የመረጃ ፍሰት ውጪ ያልተገቡ መረጃዎችንን  ማስተላለፍ አይቻልም፡፡',
                            'ማንኛውም ተዋዋይ ከድርጅቱ አገልግሎት ለማግኘትም ሆነ ቅሬታ ለማሰማት ከፈለገ አገልግሎቱን ለማግኘት ክፍያ የፈፀመበትን የድርጅቱን ህጋዊ ደረሰኝ ይዞ መገኘት ብሎም የሞባይል መተግበሪያው ላይ በአግባቡ መመዝገቡን ማረጋገጥ አለበት፡፡ ይህ ባልተሟላበት ሁኔታ የሚቀርብ ማንኛውም የአገልግሎት ጥያቄም ሆነ ቅሬታ ተቀባይነት አይኖረውም፡፡',
                            'ማንኛውም ተዋዋይ በተመሳሳይ ወይም ተቀራራቢነት ያለቸው ድርጅቶች ላይ እየሰራ መሆኑን ለድርጅቱ በ3ቀን ውስጥ ማሳወቅ ይነኖርበታል  ሳያሳውቅ ቢቀርና ድርጅቱ  ካረጋገጠ ከድርጅቱ ወዲያውኑ ይሰረዛል፡፡',
                            'አንድ ግለሰብ ከአንድ ግዜ በላይ ራሱን በአገልግሎት መስጪያ የሞባይል መተግበሪያ ላይ መመዝገብ አይችልም፡፡ በማንኛውም ሁኔታ ግን አንድ ግለሰብ ከአንድ ግዜ በላይ ተመዝግቦ ቢገኝ አንዱን ብቻ በማስቀረት ቀሪዎቹን ሁሉ ድርጅቱ የመሰረዝ መብት አለው፡፡',
                            'እድሜ ከ18 ዓመት በላይ የሆነ ሁሉ በመተግበሪያው መጠቀም ይችላላ፡፡'
                        ]
                    },
                    agreement: {
                        title: '3. ውሉ የሚቆይበት ጊዜ',
                        para: 'ከዚህ በታች የውሉ ጊዜ ከማለቁ በፊት ውሉን ለማቋረጥና የሚቻልባቸው ምክንያቶች ተብለው ከተዘረዘሩት ምክንያቶች ውስጥ አንዱ ወይምንም ሁሉመ ካላጋጠሙ በቀር ይህ ውል በተዋዋይ እና በድርጅቱ መካከል ላልተወሰነ ግዜ ፀንቶ ይቆያል፡፡'
                    },
                    ownership: {
                        title: '4. ባለቤትነት',
                        para: 'ሁሉም የድርጅቱ የንግድ ምልክቶች እና ስያሜዎች ስልጠና አሰጣጥ መመሪያ እና ተያያዥ ደጋፊ መሣሪያ/መገልገያዎች ለስራው አመቺነት ለተዋዋዩ የሚሠጡ ማናቸውም ንብረቶች ባለቤትነት የድርጅቱ ብቻ ይሆናል፡፡'
                    },
                    partnership: {
                        title: '5. ሽርክና የሌለ ስለመሆኑ',
                        para: 'ይህ ስምምነት ምንም አይነት የአሰሪና ሰራተኛ እና የሽርክና ግንኙነትን አያቋቁምም፡፡ ተዋዋዩም ድርጅቱን በመወከል ከሌሎች ሶስተኛ ወገኖች ጋር ለመዋዋል የሚያስችል አይደለም፡፡'
                    },
                    payment: {
                        title: '6. ክፍያ',
                        lists: [
                            'ተዋዋዩ የድርጅቱን የሞባይል መተግበሪያ በመጠቀም ለሚያገኘው አገልግሎት በድርጅቱ የሚወሰነውን የአገልግሎት ክፍያ ለመክፈል ተስማምቷል፡፡ የአገልግሎት ክፍያው በየግዜው ማሻሻያ ሊደረግበት የሚችል ሲሆን አገልግሎት ተጠቃሚዎች በድርጅቱ ዌብ ሳይት እና ማህበራዊ ሚዲያ የአገልግሎት ክፍያ እና ተመኑን እንዲያውቁት ይደረጋል፡፡ አገልግሎት ተጠቃሚው ስለአገልግሎት ሰጪው ድርጅት ድርጅታዊ አቋም እና የአሰራር ስልት ለሌሎች ሰዎች በማስተዋወቁ ምክኒያት ከሚያገኘው በፍቃደኝነት ላይ የተመሰረተ እቁብ ወይንም ስጦታ በስተቀር ከድርጅቱ ወይንም አገልግሎት ሰጪው የሚከፈለው ምንም አይነት ክፍያ የሌለ መሆኑን አገልግሎት ተጠቃሚው ያውቃል፡፡',
                            'በስህተት የተከፈለና  ወደ ድርጅቱ አካውንት ገቢ ለተደረገ ክፍያ ሊመለስ የሚችለው አስገቢው ግለሰብ ለድርጅቱ በ3 ቀን ውስጥ በጽሁፍ የተደገፈ ማመልከቻ ከገቢ ባንክ ኦርጅናል ማስረጃ  በአካል ማቅረብ ይኖርበታል ድርጅቱ በስህተት የገባ 15% መሆኑን ሲያረጋግጥ በ2ቀን ውስጥ ገንዘቡን የመንግስትን ታክስ በመቀነስ ተመላሽ ያደርጋል፡፡',
                            'እንደ ዕጣው ደረጃና መጠን 20,000, 60,000 እና200,000  ብር እጣ የወጣለት በደንቡ መሰረት 5% የአገልግሎት ክፍያ  በ3 ቀን ውስጥ መክፍል ይኖርበታል፡፡'
                        ]
                    },
                    TerminationOfCcontract: {
                        title: '7. ውልን ስለማቋረጥ',
                        lists: [
                            '7.1 ውልን ለማቋረጥ የሚበቃ በቂና አሣማኝ ምክንያት መኖሩ ሲታወቅ ድርጅቱ የፅሁፍ ማስጠንቀቂያ በመስጠት ወዲያውኑ ውሉን ማቋረጥ ይችላል፡',
                            '7.2 በቂና አሣማኝ ምክንያቶች የስነምግባር እና የህግ ጥሰቶች የሚባሉት በዚህ ውል ተራ ቁጥር 2 የተጠቀሡት የውሉ አንቀፆችና ወደፊት እንደ የአስፈላጊነቱ ለአሰራር እንዲያመች ድርጅቱ የሚያውጣቸው ደንብ እና መመሪያዎች እና በኢትዮጵያ ውስጥ በስራ ላይ ያሉ የወንጀልና ፍትሐብሄር ህጎች ላይ ወንጀል ወይንም ህገወጥ ተግባር ተብለው የተጠቀሱ የህግ የስነምግባር እና ደንብ ሁኔታዎች ተጥሰው ሲገኙ ነው፡፡',
                            '7.3 ዋነኛ የዚህ ስምምነት የውል አንቀፆች ጥሰት እና ወይንም የድርጅቱንም ሆነ የተዋዋዩን መልካም ስም እና ዝና የሚያጎድፉ ወይንም ጉዳት የሚያደርሱ ድርጊቶችን መፈፀም ያለማስጠንቀቂያ ውሉን ለማቋረጥ ይቻላል፡፡'
                        ]
                    },
                    KeepingAsecret: {
                        title: '8. ሚስጥር መጠበቅ',
                        paras: [
                            '8.1.   በዚህ ውል የተመለከቱ ኃላፊነቶችን ለመወጣት ያስችል ዘንድ ድርጅቱ ለተዋዋዩ የሚሠጣቸው ሚስጥራዊ እና የድርጅቱ ብቸኛ ባለቤትነት ያላቸውን መረጃዎች በሙሉ በሚስጥር የሚያዙ እንደሆነ ተዋዋዩ ያውቃል፡፡',
                            '8.2.  እነዚህን ሚስጥራዊ እና የድርጅቱ ብቸኛ የባለቤትነት መብት የያዘባቸውን መረጃዎች ለሌሎች ሶስተኛ ወገኖች አሣልፎ መስጠት ድርጅቱን ጉዳት ሊያስከትል እንደሚችል ተዋዋዩ ያውቃል፡፡',
                            '8.3.  ተዋዋይ ለሚሰራው ስራ አስፈላጊ በመሆኑ ምክኒያት እና በድርጅቱ በግልፅ እና በፀሁፍ በተደረገ ስምምነት ካልሆነ በስተቀር ተዋዋይ ሚስጢራዊ የሆኑ እና የብቸኛ መብት ያላቸውን መረጃዎች ለሶስተኛ ወገን ማስተላለፍ ወይንም መጠቀም ውሉ ፀንቶ ባለበት ጊዜም ይሁን ውሉ ከተቋረጠም በኃላ ፍፁም አይቻልም፡፡ ሚስጥራዊ መረጃ ወይንም ብቸኛ መብት ያላቸው መረጃዎች ከዚህ ሚከተሉትን ያካትታል፡፡'
                        ],
                        lists: [
                            'የተፃፈ፣ የታተመ፣ የንድፍ ስራ፣ ወይም በኤሌክትሮኒክስ ምስል ወይንም ድምፅ በድርጅቱ የተዘጋጀ እና ለተወያዩ የተላለፈ፤',
                            'ማንኛውም የተፃፈ ወይንም በግልፅ የሚታይ “ሚስጥራዊ” ወይንም ብቸኛ መብት የሚል የታተመበት ወይንም በተመሣሣይ ሁኔታ ወይንም በልማድ ድርጅቱ ሚስጥር ብሎ የጠበቃቸውን እና የያዛቸው መረጃዎች',
                            'የአሰራር እና የሽያጭ እቅድ አፈፃፀም፣ የደንበኞች ዝርዝር፣ የአሰራር ሰዓት ፣ የንግድ ሚስጢር፣ ስነልኬት፣ ስነ ቀመር፣ የአሰራር ስልትና አካሄድ፣ የኮምፒውተር ፕጎግራም ወይንም ፈጠራ ወይንም ማንኛውም ማሻሻያ፣ የዋጋ ትመና እና የሽያጭ ቅድመ ትንተና፡፡',
                            'ተዋዋዩ በስራው ምክኒያት ካወቃቸው የድርጅቱ ደንበኛዎች እና አቅራቢዎች የሆኑ ግለሰቦች ወይንም ደንበኞቻችን የሚመለከት ማንኛውም መረጃን ያጠቃልላል፡፡'
                        ],
                        lastpara: 'በማንኛውም ሁኔታ ይህ ውል በሚቋረጥ ጊዜ ተዋዋዩ ለስራው ያመቸው ዘንድ ከድርጅቱ የተረከባቸው ማንኛውንም ንብረቶች ወዲያውኑ ለድርጅቱ ያስረክባል፡፡'
                    },
                    Compensation: {
                        title: '9. ካሳ ክፍያን በተመለከተ',
                        para: 'ተዋዋዩ በዚህ ውል አፈፃፀም ሂደት ውስጥ በዚህ ውል ተራ ቁጥር ሁለት(2) የተጠቀሱትን የአሰራር ስርዓት እና ክልከላዎች በመተላለፉ ምክኒያት ለሚያጠፋቸው ጥፋቶች ሁሉ ድርጅቱ ላይ ላስከተለው ጉዳት በቂ የሆነ ካሳ የመክፈል ግዴታ አለበት፡፡'
                    },
                    ApplicableLaws: {
                        title: '10. ተፈፃሚ ህጎች',
                        para: 'በዚህ ውል ያልተካተቱ እና ለዚህ ውል አፈፃፀም አግባብነት ያላቸው በኢትዮጵያ የፍትሐብሄር ህግ ስለውሎች በጠቅላላው በሚለው ስር የተካተቱ አንቀፆች እንደ አግባብነታቸው ተፈፃሚ ይሆናሉ ::'
                    },
                    Improvement: {
                        title: '11. ማሻሻያ',
                        para: 'ይህ ውል በተዋዋይ ወገኖች የጋራ ግልፅ ፍላጐት እና የፅሁፍ ስምምነት መሰረት ሊሻሻል ወይንም ሊለወጥ ይችላል፡፡'
                    },
                    termination: ' ወደ ድርጅቱ በይነ መረብ ሲገቡ እና ሲመዘገቡ ይህንን ውል አንብበው እና ተረድተው እንደተስማሙ ይቆጠራል፡'
                }
            }
        },
                computed: {
            ...mapGetters({
                user: "auth/user",
            })
        },
    }
</script>